app/controllers/events_controller.rb

  def index
     @j = UserEvent.where(user_id: current_user.id)
      @u = []
    @j.each do |j|
      @u <<j.event_id
    end
    @events = Event.where.not(id: @u).where.not(username:current_user.username)
---
SELECT "user_events".* FROM "user_events" WHERE "user_events"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "sayed1"]]
SELECT "events".* FROM "events" WHERE ("events"."id" NOT IN (2, 3)) AND ("events"."username" != ?)  [["username", "abdo"]]

  def watch
     @event = Event.find_by_name(params[:name])
---
SELECT  "events".* FROM "events" WHERE "events"."name" = ? LIMIT 1  [["name", "naser1"]]

  def search
    @event = Event.where(name: params[:name])
---
SELECT  "events".* FROM "events" WHERE "events"."name" = ? LIMIT 1  [["name", "sadat"]]

  def view
    @j = UserEvent.where(user_id: current_user.id)
      @u = []
    @j.each do |j|
      @u <<j.event_id
    end
      @event= Event.where(id: @u).where.not(username:current_user.username)
---
SELECT "user_events".* FROM "user_events" WHERE "user_events"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
SELECT "events".* FROM "events" WHERE "events"."id" IN (1, 2) AND ("events"."username" != ?)  [["username", "sayed1"]]

  def myevents
    @event = Event.where(username: current_user.username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "sayed1"]]
SELECT "events".* FROM "events" WHERE "events"."username" = ?  [["username", "sayed1"]]

  def going
    @event = Event.find(params[:id])
    if UserEvent.exists?(user_id: current_user.id, event_id: @event.id)
      render :template=>"events/message.json.jbuilder",locals:{message: "you already joined"},:success => true, :status => :ok ,:formats => [:json]
    else
      @j = UserEvent.new
      @event.user_events << @j
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "user_events" WHERE "user_events"."user_id" = ? AND "user_events"."event_id" = ? LIMIT 1  [["user_id", 2], ["event_id", 2]]
INSERT INTO "user_events" ("event_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["event_id", 2], ["created_at", "2015-09-10 01:35:48.089670"], ["updated_at", "2015-09-10 01:35:48.089670"]]

  def create
    @j = UserEvent.new
    @event = Event.new(event_params)
    @event.username = current_user.username

  respond_to do |format|
    if @event.save
---
INSERT INTO "events" ("name", "date", "description", "location", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "opaak"], ["date", 11], ["description", "henak"], ["location", "lolz"], ["username", "sayed1"], ["created_at", "2015-09-10 00:20:14.022290"], ["updated_at", "2015-09-10 00:20:14.022290"]]

  def update
      @event = Event.find(params[:id])
    if Event.exists?(username: current_user.username , id: @event.id)
       if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT  1 AS one FROM "events" WHERE "events"."username" = ? AND "events"."id" = ? LIMIT 1  [["username", "ahmed"], ["id", 6]]
UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "naser1"], ["updated_at", "2015-09-14 22:46:37.031968"], ["id", 2]]

  def destroy
    @event = Event.find(params[:id])
    if Event.exists?(username: current_user.username , id: @event.id)
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "events" WHERE "events"."username" = ? AND "events"."id" = ? LIMIT 1  [["username", "ahmed"], ["id", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]