app/controllers/users_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "medhat@yahoo.com"]]
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "ahmed"], ["email", "medhat@yahoo.com"], ["password", "a7mad"], ["created_at", "2015-09-09 23:43:48.363886"], ["updated_at", "2015-09-09 23:43:48.363886"]]
---
  def create
    @user = User.new(user_params)
    if User.exists?(username: @user.username) || User.exists?(email: @user.email)
       render :template=>"users/error.json.jbuilder",locals:{message: "Username or Email already exists"},:success => true, :status => :ok ,:formats => [:json]
    else
    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "sayed1"], ["updated_at", "2015-09-10 00:01:05.024191"], ["id", 1]]
---
  def update
    @user = User.find(current_user.id)
    respond_to do |format|
    if @user.update_attributes(params.require(:user).permit(:email,:password))

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    current_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "ahmed"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT 1  [["username", "ahmed"], ["password", "a7madmed7at"]]
---
   def login
      #authenticate_or_request_with_http_basic do |username, password|
       #Rails.logger.info "API authentication:#{username} #{password}"
        if User.exists?(username: params[:username], password: params[:password])